<!DOCTYPE html>
<!-- Ejercicio 3.2.html -->
<html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Ejercicio 3.2</title>
    </head>

    <body>
        <a href="../../index.html"><input type="button" value="Regresar"></a>

        <header>
        <h3>3.2: Indique si cada uno de los siguientes enunciados es
            <em>verdadero</em> o <em>falso</em>. Si es <em>falso</em>,
            explique el por qu&eacute;.
        </h3>
        </header>
        <p>
            <ol type="a">
                <li>
                    <strong>
                        Cualquier tipo input particular de formulario de HTML5 debe desplegarse de manera id&eacute;ntica
                        en todos los navegadores compatibles con HTML5.
                    </strong><br>
                    R: Falso, pueden variar entre navegadores.<br><br>
                </li>
                <li>
                    <strong>
                        Cuando se coloca el enfoque en el campo de texto (es decir, si el cursor est&aacute; en el campo de texto),
                        se env&iacute;a el texto del atributo placeholder al servidor.
                    </strong><br>
                    R: Falso, el texto placeholder desaparece y no se env&iacute;a aunque el usuario haya dado clic en el
                    bot&oint;n enviar.<br><br>
                </li>
                <li>
                    <strong>
                        No es necesario incluir el atributo autofocus en sus formularios.
                    </strong><br>
                    R: Verdadero, no hay problema si se agrega o no.<br><br>
                </li>
                <li>
                    <strong>
                        Los nuevos tipos input de HTML5 tienen validaci&oacute;n autom&aacute;tica del lado del cliente, con lo cual
                        se elimina la necesidad de agregar secuencias de comandos (script) complicadas a sus formularios para validar
                        la entrada del usuario y se reduce la cantidad de datos inv&aacute;lidos que se env&iacute;an.
                    </strong><br>
                    R: Verdadero, de esta manera se ahorran unas l&iacute;neas de c&oacute;digo.<br><br>
                </li>
                <li>
                    <strong>
                        El tipo input range se valida autom&aacute;ticamente de manera intr&iacute;seca cuando el navegador lo despliega
                        como un control deslizante, ya que el usuario no puede mover el control fuera de los l&iacute;mites del valor
                        m&iacute;nimo o m&aacute;ximo..
                    </strong><br>
                    R: Verdadero.<br><br>
                </li>
                <li>
                    <strong>
                        HTML5 cuenta con una validaci&oacute;n autom&aacute;tica para el tipo input tel.
                    </strong><br>
                    R: Falso, HTML5 no cuenta con esta validaci&oacute;n debido a que el formato de los n&uacute;meros telef&oacute;nicos
                    var&iacute;a en muchas zonas.<br><br>
                </li>
                <li>
                    <strong>
                        Si el usuario introduce un URL con un formato inapropiado en un tipo input url, no se validar&aacute;.
                        HTML5 no valida si el URL introducido existe en realidad.
                    </strong><br>
                    R: Verdadero.<br><br>
                </li>
                <li>
                    <strong>
                        El elemento nav muestra un men&uacute; desplegable de hiperv&iacute;nculos.
                    </strong><br>
                    R: Falso, este elemento agrupa v&iacute;nculos de navegaci&oacute;n.<br><br>
                </li>
                <li>
                    <strong>
                        El elemento header puede usarse s&oacute;lo una vez en la p&aacute;gina.
                    </strong><br>
                    R: Falso, se puede usar varias veces en una p&aacute;gina.<br><br>
                </li>
                <li>
                    <strong>
                        Los elementos nav pueden anidarse en un elemento aside.
                    </strong><br>
                    R: Verdadero, si se pueden agrupar.<br><br>
                </li>
                <li>
                    <strong>
                        Podemos usar el elemento brk para evitar dividir palabras en lugares incorrectos.
                    </strong><br>
                    R: Falso, para estos casos se recomienda usar wbr.<br><br>
                </li>
            </ol>
        </p>
    </body>
</html>